TianpeiLee/rotorflight-firmware/src/main/target/STM32_UNIFIED/target.h
/*
 * This file is part of Cleanflight and Betaflight.
 *
 * Cleanflight and Betaflight are free software. You can redistribute
 * this software and/or modify this software under the terms of the
 * GNU General Public License as published by the Free Software
 * Foundation, either version 3 of the License, or (at your option)
 * any later version.
 *
 * Cleanflight and Betaflight are distributed in the hope that they
 * will be useful, but WITHOUT ANY WARRANTY; without even the implied
 * warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
 * See the GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this software.
 *
 * If not, see <http://www.gnu.org/licenses/>.
 */

#pragma once

/*
 * Common definitions for all STM32 targets
 */

#define USE_UNIFIED_TARGET

#define USE_CUSTOM_DEFAULTS

#define USE_BEEPER

#undef  USE_GYRO_DLPF_EXPERIMENTAL
// #define USE_GYRO_CLK

#define USE_ACC
#define USE_GYRO

#undef USE_ACC_MPU6050
#undef USE_GYRO_MPU6050
#undef USE_ACC_MPU6500
#undef USE_GYRO_MPU6500
#define USE_ACC_SPI_MPU6500
#define USE_GYRO_SPI_MPU6500
#define USE_ACC_SPI_MPU6000
#define USE_GYRO_SPI_MPU6000
#define USE_ACC_SPI_ICM20689
#define USE_GYRO_SPI_ICM20689
#undef USE_ACCGYRO_LSM6DSO
#undef USE_ACCGYRO_BMI160
#define USE_ACCGYRO_BMI270
#define USE_ACCGYRO_SPI_BMI323
#define USE_ACCGYRO_SPI_BMI088
#define USE_GYRO_SPI_ICM42605
#define USE_GYRO_SPI_ICM42688P
#define USE_ACC_SPI_ICM42605
#define USE_ACC_SPI_ICM42688P

#define USE_MAG
#define USE_MAG_DATA_READY_SIGNAL
#define USE_MAG_HMC5883
#define USE_MAG_SPI_HMC5883
#define USE_MAG_QMC5883
#define USE_MAG_LIS3MDL
#define USE_MAG_AK8963
#define USE_MAG_MPU925X_AK8963
#define USE_MAG_SPI_AK8963
#define USE_MAG_AK8975

#define USE_BARO
#define USE_BARO_MS5611
#define USE_BARO_SPI_MS5611
#define USE_BARO_BMP085
#define USE_BARO_BMP280
#define USE_BARO_SPI_BMP280
#define USE_BARO_BMP388
#define USE_BARO_SPI_BMP388
#define USE_BARO_LPS
#define USE_BARO_SPI_LPS
#define USE_BARO_QMP6988
#define USE_BARO_SPI_QMP6988
#define USE_BARO_DPS310
#define USE_BARO_SPI_DPS310
#define USE_BARO_BMP581
#define USE_BARO_SPI_BMP581

#define USE_SDCARD
#define USE_SDCARD_SPI

#define USE_FLASHFS
#define USE_FLASHFS_LOOP
#define USE_FLASH_TOOLS
#define USE_FLASH_M25P16
#define USE_FLASH_W25N01G
#define USE_FLASH_W25M
#define USE_FLASH_W25M512
#define USE_FLASH_W25M02G
#define USE_FLASH_W25Q128FV

#define USE_SPI
#define SPI_FULL_RECONFIGURABILITY

#define USE_I2C
#define I2C_FULL_RECONFIGURABILITY

#define USE_VCP

// #define USE_SOFTSERIAL1
// #define USE_SOFTSERIAL2

// #define UNIFIED_SERIAL_PORT_COUNT       3

#define USE_USB_DETECT

#define USE_ESCSERIAL

#define USE_ADC

#define USE_FREQ_SENSOR

#define USE_SERVO_GEOMETRY_CORRECTION

#define USE_CMS

#undef USE_CRSF_V3

#undef USE_OSD
#undef USE_MAX7456
#undef USE_RCDEVICE
#undef USE_VTX_COMMON
#undef USE_VTX_CONTROL
#undef USE_VTX_SMARTAUDIO
#undef USE_VTX_TRAMP
#undef USE_CAMERA_CONTROL

#undef USE_RX_FRSKY_SPI_D
#undef USE_RX_FRSKY_SPI_X
#undef USE_RX_SFHSS_SPI
#undef USE_RX_REDPINE_SPI
#undef USE_RX_FRSKY_SPI_TELEMETRY
#undef USE_RX_CC2500_SPI_PA_LNA
#undef USE_RX_CC2500_SPI_DIVERSITY
#undef USE_RX_FLYSKY
#undef USE_RX_FLYSKY_SPI_LED
#undef USE_RX_SPEKTRUM
#undef USE_RX_SPEKTRUM_TELEMETRY
#undef USE_RX_EXPRESSLRS
#undef USE_RX_SX1280
#undef USE_RX_SX127X


/*
 * STM32F405
 */

#if defined(STM32F405)

#define TARGET_BOARD_IDENTIFIER "S405"

#define USBD_PRODUCT_STRING     "Rotorflight STM32F405"

#define USE_I2C_DEVICE_1
#define USE_I2C_DEVICE_2
#define USE_I2C_DEVICE_3

#define USE_UART1
#define USE_UART2
#define USE_UART3
#define USE_UART4
#define USE_UART5
#define USE_UART6

#define SERIAL_PORT_COUNT       (UNIFIED_SERIAL_PORT_COUNT + 6)

#define USE_INVERTER

#define USE_SDCARD_SDIO

#define USE_SPI_DEVICE_1
#define USE_SPI_DEVICE_2
#define USE_SPI_DEVICE_3

#define TARGET_IO_PORTA 0xffff
#define TARGET_IO_PORTB 0xffff
#define TARGET_IO_PORTC 0xffff
#define TARGET_IO_PORTD 0xffff
#define TARGET_IO_PORTE 0xffff
#define TARGET_IO_PORTF 0xffff

#define VOLTAGE_TASK_FREQ_HZ     100
#define CURRENT_TASK_FREQ_HZ     100
#define ESC_SENSOR_TASK_FREQ_HZ  100

#define DEFAULT_FEATURES         (FEATURE_DYN_NOTCH)


/*
 * STM32F411
 */

#elif defined(STM32F411)

#define TARGET_BOARD_IDENTIFIER "S411"

#define USBD_PRODUCT_STRING     "Rotorflight STM32F411"

#define USE_I2C_DEVICE_1
#define USE_I2C_DEVICE_2
#define USE_I2C_DEVICE_3

#define USE_UART1
#define USE_UART2
#define USE_UART6

#define SERIAL_PORT_COUNT       (UNIFIED_SERIAL_PORT_COUNT + 3)

#define USE_INVERTER

#define USE_SPI_DEVICE_1
#define USE_SPI_DEVICE_2
#define USE_SPI_DEVICE_3

#define TARGET_IO_PORTA 0xffff
#define TARGET_IO_PORTB 0xffff
#define TARGET_IO_PORTC 0xffff
#define TARGET_IO_PORTD 0xffff
#define TARGET_IO_PORTE 0xffff

#define VOLTAGE_TASK_FREQ_HZ     100
#define CURRENT_TASK_FREQ_HZ     100
#define ESC_SENSOR_TASK_FREQ_HZ  100

#define DEFAULT_FEATURES         (0)

#undef USE_GYRO_CLK
#undef USE_MULTI_GYRO
#undef USE_FBUS_MASTER
#undef USE_SPORT_MASTER
#undef USE_BUS_SERVO

// Remove drivers that are not supported by any existinting F411 boards
#undef USE_ACCGYRO_SPI_BMI323
#undef USE_ACCGYRO_SPI_BMI088

#undef USE_BARO_BMP085
#undef USE_BARO_BMP388
#undef USE_BARO_SPI_BMP388
#undef USE_BARO_LPS
#undef USE_BARO_SPI_LPS
#undef USE_BARO_QMP6988
#undef USE_BARO_SPI_QMP6988
#undef USE_BARO_BMP581
#undef USE_BARO_SPI_BMP581

#undef USE_FLASH_TOOLS
#undef USE_FLASH_W25M512
#undef USE_FLASH_W25M02G
#undef USE_FLASH_W25N01G

#undef USE_SDCARD
#undef USE_SDCARD_SPI

#undef USE_RANGEFINDER

#undef USE_GPS
#undef USE_MAG


/*
 * STM32F7x2
 */

#elif defined(STM32F7X2)

#define TARGET_BOARD_IDENTIFIER "S7X2"

#define USBD_PRODUCT_STRING     "Rotorflight STM32F7x2"

#define USE_I2C_DEVICE_1
#define USE_I2C_DEVICE_2
#define USE_I2C_DEVICE_3

#define USE_UART1
#define USE_UART2
#define USE_UART3
#define USE_UART4
#define USE_UART5
#define USE_UART6

#define SERIAL_PORT_COUNT       (UNIFIED_SERIAL_PORT_COUNT + 6)

#define USE_SDCARD_SDIO

#define USE_SPI_DEVICE_1
#define USE_SPI_DEVICE_2
#define USE_SPI_DEVICE_3

#define TARGET_IO_PORTA 0xffff
#define TARGET_IO_PORTB 0xffff
#define TARGET_IO_PORTC 0xffff
#define TARGET_IO_PORTD 0xffff
#define TARGET_IO_PORTE 0xffff
#define TARGET_IO_PORTF 0xffff

#define VOLTAGE_TASK_FREQ_HZ     200
#define CURRENT_TASK_FREQ_HZ     200
#define ESC_SENSOR_TASK_FREQ_HZ  200

#define DEFAULT_FEATURES         (FEATURE_DYN_NOTCH)


/*
 * STM32F745
 */

#elif defined(STM32F745)

#define TARGET_BOARD_IDENTIFIER "S745"

#define USBD_PRODUCT_STRING     "Rotorflight STM32F745"

#define USE_I2C_DEVICE_1
#define USE_I2C_DEVICE_2
#define USE_I2C_DEVICE_3
#define USE_I2C_DEVICE_4

#define USE_UART1
#define USE_UART2
#define USE_UART3
#define USE_UART4
#define USE_UART5
#define USE_UART6
#define USE_UART7
#define USE_UART8

#define SERIAL_PORT_COUNT       (UNIFIED_SERIAL_PORT_COUNT + 8)

#define USE_SDCARD_SDIO

#define USE_SPI_DEVICE_1
#define USE_SPI_DEVICE_2
#define USE_SPI_DEVICE_3
#define USE_SPI_DEVICE_4

#define TARGET_IO_PORTA 0xffff
#define TARGET_IO_PORTB 0xffff
#define TARGET_IO_PORTC 0xffff
#define TARGET_IO_PORTD 0xffff
#define TARGET_IO_PORTE 0xffff
#define TARGET_IO_PORTF 0xffff

#define VOLTAGE_TASK_FREQ_HZ     200
#define CURRENT_TASK_FREQ_HZ     200
#define ESC_SENSOR_TASK_FREQ_HZ  200

#define DEFAULT_FEATURES         (FEATURE_DYN_NOTCH)


/*
 * STM32G47x
 */

#elif defined(STM32G47X)

#define TARGET_BOARD_IDENTIFIER "SG47"

#define USBD_PRODUCT_STRING     "Rotorflight STM32G47x"

#define USE_I2C_DEVICE_1
#define USE_I2C_DEVICE_2
#define USE_I2C_DEVICE_3
#define USE_I2C_DEVICE_4

#define USE_UART1
#define USE_UART2
#define USE_UART3
#define USE_UART4
#define USE_UART5
#define USE_LPUART1

#define SERIAL_PORT_COUNT       (UNIFIED_SERIAL_PORT_COUNT + 6)

#undef  USE_MULTI_GYRO
#undef USE_BLHELI_FORWARD_PROGRAMMING
#undef USE_AM32_FORWARD_PROGRAMMING
#undef USE_FBUS_MASTER
#undef USE_SPORT_MASTER
#undef USE_BUS_SERVO

#define USE_SPI_DEVICE_1
#define USE_SPI_DEVICE_2
#define USE_SPI_DEVICE_3
#define USE_SPI_DEVICE_4

#define TARGET_IO_PORTA 0xffff
#define TARGET_IO_PORTB 0xffff
#define TARGET_IO_PORTC 0xffff
#define TARGET_IO_PORTD 0xffff
#define TARGET_IO_PORTE 0xffff
#define TARGET_IO_PORTF 0xffff

#define VOLTAGE_TASK_FREQ_HZ     100
#define CURRENT_TASK_FREQ_HZ     100
#define ESC_SENSOR_TASK_FREQ_HZ  100

#define DEFAULT_FEATURES         (FEATURE_DYN_NOTCH)


/*
 * STM32H743
 */

#elif defined(STM32H743)

#define TARGET_BOARD_IDENTIFIER "SH74"

#define USBD_PRODUCT_STRING     "Rotorflight STM32H743"

#define USE_I2C_DEVICE_1
#define USE_I2C_DEVICE_2
#define USE_I2C_DEVICE_3
#define USE_I2C_DEVICE_4

#define USE_UART1
#define USE_UART2
#define USE_UART3
#define USE_UART4
#define USE_UART5
#define USE_UART6
#define USE_UART7
#define USE_UART8
#define USE_LPUART1

#define SERIAL_PORT_COUNT       (UNIFIED_SERIAL_PORT_COUNT + 9)

#define USE_SDCARD_SDIO

#define USE_SPI_DEVICE_1
#define USE_SPI_DEVICE_2
#define USE_SPI_DEVICE_3
#define USE_SPI_DEVICE_4
#define USE_SPI_DEVICE_5
#define USE_SPI_DEVICE_6

#define TARGET_IO_PORTA 0xffff
#define TARGET_IO_PORTB 0xffff
#define TARGET_IO_PORTC 0xffff
#define TARGET_IO_PORTD 0xffff
#define TARGET_IO_PORTE 0xffff
#define TARGET_IO_PORTF 0xffff
#define TARGET_IO_PORTG 0xffff

#define VOLTAGE_TASK_FREQ_HZ     250
#define CURRENT_TASK_FREQ_HZ     250
#define ESC_SENSOR_TASK_FREQ_HZ  250

#define USE_LEDSTRIP_CACHE_MGMT

#define DEFAULT_FEATURES         (FEATURE_DYN_NOTCH)


#elif defined(CH32H41x)

#define V5_V3_CLOCK_RATE                    4

#undef I2C_FULL_RECONFIGURABILITY
#undef SPI_FULL_RECONFIGURABILITY

#define TARGET_BOARD_IDENTIFIER "H415"
#define USBD_PRODUCT_STRING     "Rotorflight CH323H415"

#define USE_VCP
#define UNIFIED_SERIAL_PORT_COUNT       1

#define USE_I2C
// #define USE_I2C_DEVICE_1
#define USE_I2C_DEVICE_2
// #define USE_I2C_DEVICE_3
// #define USE_I2C_DEVICE_4

#define I2C_DEVICE_2            (I2CDEV_2)
#define I2C2_SCL                PC0
#define I2C2_SDA                PC1


#define USE_UART1
#define USE_UART2
#define USE_UART3
#define USE_UART4
#define USE_UART5
#define USE_UART6
#define USE_UART7
#define USE_UART8

#define SERIAL_PORT_COUNT       (UNIFIED_SERIAL_PORT_COUNT + 8)



#define USE_SPI
// #define USE_SPI_DEVICE_1
#define USE_SPI_DEVICE_2
#define USE_SPI_DEVICE_3
#define USE_SPI_DEVICE_4
#define USE_SPI_DMA_ENABLE_EARLY

#define USE_EXTI
#define USE_DNA_MUX

#define TARGET_IO_PORTA 0xff1f
#define TARGET_IO_PORTB 0xff7c
#define TARGET_IO_PORTC 0xffff
#define TARGET_IO_PORTD 0xffff
#define TARGET_IO_PORTE 0xffff
#define TARGET_IO_PORTF 0xffff

#define VOLTAGE_TASK_FREQ_HZ     200
#define CURRENT_TASK_FREQ_HZ     200
#define ESC_SENSOR_TASK_FREQ_HZ  200

#define DEFAULT_FEATURES         (FEATURE_DYN_NOTCH)

#define USE_ADC

#define ADC_INSTANCE                        ADC1
#define ADC1_DMA_OPT                        0
#define VBAT_ADC_PIN                        PC3
#define CURRENT_METER_ADC_PIN               PC2
#define DEFAULT_VOLTAGE_METER_SOURCE        VOLTAGE_METER_ADC
#define DEFAULT_CURRENT_METER_SOURCE        CURRENT_METER_ADC



#undef USE_TRANSPONDER
#undef USE_DSHOT_DMAR
#define USE_DSHOT_BITBAND
#define USE_BEEPER
#define USE_ESCSERIAL
// #define FLASH_PAGE_SIZE ((uint32_t)0x2000) // 8K sectors




#define LED0_PIN                            PC4

#define USE_ACC
#define USE_ACC_SPI_ICM42688P

#define USE_BARO
#define USE_BARO_DPS310
#define DEFAULT_BARO_DPS310

#define USE_GYRO
#define USE_GYRO_SPI_ICM42688P

#define USE_FLASH
#define USE_FLASH_M25P16
#define ENABLE_BLACKBOX_LOGGING_ON_SPIFLASH_BY_DEFAULT

// #define CAMERA_CONTROL_PIN                  PA4

#define UART1_TX_PIN                        PA9
#define UART2_TX_PIN                        PA2
#define UART3_TX_PIN                        PA13
#define UART4_TX_PIN                        PC6
#define UART5_TX_PIN                        PE0
#define UART6_TX_PIN                        PA0
//#define UART7_TX_PIN                        PA0
#define UART8_TX_PIN                        PB4

#define UART1_RX_PIN                        PA10
#define UART2_RX_PIN                        PA3
#define UART3_RX_PIN                        PA14
#define UART4_RX_PIN                        PC7
#define UART5_RX_PIN                        PF5
#define UART6_RX_PIN                        PA1
#define UART7_RX_PIN                        PB12
#define UART8_RX_PIN                        PB3



#define SPI2_SCK_PIN                        PB13
#define SPI3_SCK_PIN                        PC10
#define SPI4_SCK_PIN                        PE12

#define SPI2_MOSI_PIN                        PB15
#define SPI3_MOSI_PIN                        PC12
#define SPI4_MOSI_PIN                        PE14

#define SPI2_MISO_PIN                        PB14
#define SPI3_MISO_PIN                        PC11
#define SPI4_MISO_PIN                        PE13


#define FLASH_CS_PIN                        PB10
#define FLASH_SPI_INSTANCE                  SPI4

#define GYRO_1_EXTI_PIN                     PA15
#define GYRO_1_CS_PIN                       PF3
#define GYRO_1_SPI_INSTANCE                 SPI3

#define DEFAULT_DSHOT_BITBANG               DSHOT_BITBANG_ON

#define BARO_I2C_INSTANCE                   I2CDEV_2

#define USE_MAG
#define USE_MAG_HMC5883
#define USE_MAG_QMC5883
#define USE_MAG_LIS3MDL
#define MAG_I2C_INSTANCE                    I2CDEV_2


#define USE_SDCARD
#define USE_SDCARD_SPI
#define SDCARD_SPI_CS_PIN                   PE11
#define SDCARD_SPI_INSTANCE                 SPI2



#define BEEPER_INVERTED
#define SYSTEM_HSE_MHZ   25



/*
 * UNKNOWN target
 */

#elif !defined(UNIT_TEST)
#error "No resources defined for this Unified Target."
#endif
